# CwpReuseExistingGrids Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpReuseExistingGrids Property
ParameterTypeId Class See Also
---
"Reuse matching Grids"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpReuseExistingGrids { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpReuseExistingGrids As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpReuseExistingGrids {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace